# TextColor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableCellStyle..::..TextColor Property
TableCellStyle Class See Also
---
The text color of this cell.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Color TextColor { get; set; }
```

Visual Basic
---
```text
Public Property TextColor As Color
	Get
	Set
```

Visual C++
---
```text
public:
property Color^ TextColor {
	Color^ get ();
	void set (Color^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
TableCellStyle Class
Autodesk.Revit.DB Namespace